Tekla Open API Reference for Tekla Structures 2025
Operation.IFCExportFlags.IsBoltsEnabled Field
 Boolean indicating whether the bolts export is enabled.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsBoltsEnabled
Public IsBoltsEnabled As Boolean
Field Value
Type: Boolean
See Also
Reference
Operation.IFCExportFlags Structure
Tekla.Structures.Model.Operations Namespace